app/views/cursos/_form.html.erb

    <%= f.label :escola_id %>
    <%= f.collection_select(:escola_id, Escola.all, :id, :nome, {:inclue_blank => true}) %>
---
SELECT  "escolas".* FROM "escolas"  ORDER BY "escolas"."id" DESC LIMIT 1