app/controllers/courses_controller.rb

  def index
    # Providing simple search
    if params[:title]
      @courses = @school.courses.where(title: params[:title])
    else
      @courses = @school.courses.all
---
SELECT "courses".* FROM "courses" WHERE "courses"."school_id" = ? AND "courses"."title" = ?  [["school_id", 5], ["title", "Diferente"]]
SELECT "courses".* FROM "courses" WHERE "courses"."school_id" = ?  [["school_id", 5]]

  def create
    @course = @school.courses.new(course_params)
    if @course.save
---
INSERT INTO "courses" ("title", "description", "content", "duration", "active_students", "price", "school_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @course.update_attributes(course_params)
---
UPDATE "courses" SET "title" = ?, "duration" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["title", "New course"], ["duration", "2000-01-01 17:58:25.000000"], ["updated_at", "2016-06-02 20:58:25.391927"], ["id", 1]]

  def destroy
    if @course.destroy
---
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 3]]

  def set_school
    @school = School.find(params[:school_id])
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 5]]