app/controllers/cursos_controller.rb

SELECT  "escolas".* FROM "escolas"  ORDER BY "escolas"."id" DESC LIMIT 1
---
  def new
    @curso = Curso.new
    @escolas = Escola.all

SELECT "escolas".* FROM "escolas"
INSERT INTO "cursos" ("titulo", "descricao", "conteudo", "duracao", "alunos_ativos", "preco", "escola_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @curso = Curso.new(curso_params)
    @escolas = Escola.all

    respond_to do |format|
      if @curso.save

UPDATE "cursos" SET "titulo" = $1, "updated_at" = $2 WHERE "cursos"."id" = $3  [["titulo", "Funcionou q bom!2"], ["updated_at", "2016-06-12 00:24:56.010281"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @curso.update(curso_params)

DELETE FROM "cursos" WHERE "cursos"."id" = $1  [["id", 1]]
---
  def destroy
    @curso.destroy

SELECT  "cursos".* FROM "cursos" WHERE "cursos"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "escolas".* FROM "escolas"
---
    def set_curso
      @curso = Curso.find(params[:id])
      @escolas = Escola.all