app/controllers/escolas_controller.rb

  def index
    @escolas = Escola.all
---
SELECT "escolas".* FROM "escolas"

  def buscar
    nome_a_buscar = "%#{params[:nome]}%"
#    @escolas = Escola.where "nome like ?", "%#{@nome}%"
    @escolas = Escola.where "nome like ?", nome_a_buscar
---
SELECT "escolas".* FROM "escolas" WHERE (nome like '%o%')

  def create
    @escola = Escola.new(escola_params)

    respond_to do |format|
      if @escola.save
---
INSERT INTO "escolas" ("nome", "email", "pitch", "subdominio", "data_criacao", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @escola.destroy
---
DELETE FROM "escolas" WHERE "escolas"."id" = $1  [["id", 1]]

  def alunos_ativos
    @escolas_cursos = Escola.all
---
SELECT "escolas".* FROM "escolas"

    def set_escola
      @escola = Escola.find(params[:id])
---
SELECT  "escolas".* FROM "escolas" WHERE "escolas"."id" = $1 LIMIT 1  [["id", 1]]