app/controllers/schools_controller.rb

SELECT "schools".* FROM "schools"
---
  def index
    @schools = School.search(params[:search]).page(params[:page])

INSERT INTO "schools" ("name", "owner_email", "pitch", "subdomain", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @school = School.new(school_params)

    respond_to do |format|
      if @school.save

UPDATE "schools" SET "name" = ?, "owner_email" = ?, "subdomain" = ?, "updated_at" = ? WHERE "schools"."id" = ?  [["name", "New name"], ["owner_email", "owner@school2.com"], ["subdomain", "new-name"], ["updated_at", "2016-06-02 18:58:36.297583"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @school.update(school_params)

DELETE FROM "schools" WHERE "schools"."id" = ?  [["id", 1]]
---
  def destroy
    @school.destroy